{"pageProps":{"post":{"attributes":{"title":"Tools","description":"What tools we will be using for this course"},"html":"<h1 id=\"tools\">Tools</h1>\n<p>When it comes to building out production-ready API&#39;s, there are several moving pieces, and for each one, there are several options. We won&#39;t be covering EVERY single detail in this course. Instead we&#39;ll cover the common tools that you&#39;ll need.</p>\n<h2 id=\"runtime\">Runtime</h2>\n<p>We&#39;ll be using <strong>Node.js</strong> for this course. Why? Node.js uses JS as the language of choice. If you&#39;ve worked on web apps, then you know JS. Node.js has a rich, active ecosystem as well. I also know Node.js the best. Alternatives include Ruby, Python, Java, Go, Rust, and many more.</p>\n<h2 id=\"framework\">Framework</h2>\n<p>We could create an API without a framework, but that wouldn&#39;t be the best use of our time and isn&#39;t taking advantage of an amazing ecosystem at our fingertips. So, we&#39;ll be using <strong>Express</strong> to create our API inside of Node.js.</p>\n<h2 id=\"database\">Database</h2>\n<p>There are so many great options when choosing a database these days. We&#39;ll be using <strong>Psql</strong> or <em>Postgres</em>. It&#39;s one of the most popular DBs in the world and gives us tons of options when it&#39;s time to deploy our API. For the ORM, we&#39;ll use Prisma to interact with our DB. Prisma has proven to be a very valuable tool that can create schemas, query our DB, and even handle migrations. It also works with a variety of databases.</p>\n<h2 id=\"hosting\">Hosting</h2>\n<p>When it comes to hosting a Node.js based API, you can pretty much close your eyes then point in any direction and you&#39;ll be sure to land on a platform that supports Node. This is not a DevOps class, so we want to use a platform that manages it all for us. For that, we&#39;ll be using <strong>Render</strong>.</p>\n","slug":"tools","title":"Tools","section":"Start Here","icon":"circle-play","filePath":"/home/runner/work/API-design-v4/API-design-v4/lessons/01-start-here/B-tools.md","nextSlug":"/API-design-v4/lessons/start-here/what-we-are-building","prevSlug":"/API-design-v4/lessons/start-here/intro"}},"__N_SSG":true}