{"pageProps":{"post":{"attributes":{"title":"API Anatomy"},"html":"<h2 id=\"little-bits\">Little bits</h2>\n<p>Every API ever shares a common make up. Doesn&#39;t matter the language or the environment. What makes them different is how each one does it and what they build on top if. Let&#39;s talk about all those common bits that make up an API.</p>\n<h2 id=\"server\">Server</h2>\n<p>An API is a <strong>Server</strong>. This may seem obvious, but really needs to be understood. A server is an app that has no visual representation and is always running. Usually connected to a network and shared among many clients (UIs, web apps, mobile apps, other servers, etc). Servers usually sit in front of a DB and facilitate access to that DB. There are small exceptions here, and that would be Serverless APIs. Big difference with serverless APIs is they are not always on like a traditional server. Servers must operate on a port, a virtual place on a computers operating system where network connections start and end. Ports help computers sort out their network traffic. A server must also have an IP address, a unique location used to locate a server on a network, like the internet. An IP address helps traffic go to and from a specific device whereas a port allows targeting of specific services or apps on a device. An example would look like this:\n<code>127.0.0.1:5000</code>. Where <code>5000</code> is the port and the rest is the IP address.</p>\n<h2 id=\"route\">Route</h2>\n<p>A route is a unique combination of a URL path and a HTTP Method. Routes are used to locate certain resources or trigger certain actions on an API.</p>\n<p>HTTP Methods or Verbs are constants that are used by API developers and HTTP to help determine intent of an API call. There are many methods, but the common ones are:</p>\n<ul>\n<li><code>GET</code> - used to get information from an API</li>\n<li><code>POST</code> - used to mutate or create new information on an API. Usually has data sent along with the request.</li>\n<li><code>PUT</code> - used to replace existing information on an API. Usually has data sent along with the request.</li>\n<li><code>PATCH</code> - used to update existing information on an API. Usually has data sent along with the request.</li>\n<li><code>DELETE</code>- used to remove existing information on an API.</li>\n<li><code>OPTIONS</code> - used with CORS by browsers to check to see if the client is able to actually communicate with an API</li>\n</ul>\n<p>Here are some examples of routes:</p>\n<ul>\n<li><code>GET /api/user/1</code></li>\n<li><code>POST /food</code></li>\n</ul>\n<p>Engineers can design these routes and what the routes actually do however they see fit. To standardize this, there are different approaches to designing these routes. The most popular is REST. There are others like grpc, graphql, and protobuff.</p>\n<h2 id=\"route-handlers\">Route Handlers</h2>\n<p>A route handler is a function that executes when a certain route is triggered from an incoming request. Depending on the API design and intent of the request, the handler will interact with the database. Looking at our route examples above:</p>\n<ul>\n<li><p><code>GET /api/user/1</code> - if this API was a REST API, the route handler would query the database for a user with the ID of 1.</p>\n</li>\n<li><p><code>POST /food</code> - if this API was a REST API, the route handler would create a new food in the database, using the data sent along with the request.</p>\n</li>\n</ul>\n","slug":"api-anatomy","title":"API Anatomy","section":"API basics in Node.js","icon":"cloud","filePath":"/home/runner/work/API-design-v4/API-design-v4/lessons/02-api-basics-in-node/B-api-anatomy.md","nextSlug":"/API-design-v4/lessons/intro-to-express/express-enters-the-chat","prevSlug":"/API-design-v4/lessons/api-basics-in-node/vanilla-server"}},"__N_SSG":true}