{"pageProps":{"post":{"attributes":{},"html":"<p>As your API gets bigger, it&#39;s harder to keep track of things like secrets, options, env vars, etc., especially across different environments. We need want to be able to give our app the flexibility to adapt to each environment (local, staging, prod, etc) without having to change too much. It would be awesome, if everything we needed to change was in one place that we could import everywhere.</p>\n<h2 id=\"node_env\">NODE_ENV</h2>\n<p>Environment variables are values provided from the environment at run time. They&#39;re perfect for injecting secret values your server needs, but are too dangerous to store in git.\n<br>\nOne very important env var is <code>NODE_ENV</code>. This env var is usually tasked with determining the &quot;mode&quot; your app is running. Some examples are:</p>\n<ul>\n<li><code>development</code> (default)</li>\n<li><code>production</code></li>\n<li><code>testing</code></li>\n</ul>\n<br>\n\n<p>Some packages like <code>React</code> behave differently, depending on the value of this env var. We may also want our code to use different values as well. For instance, if we have analytics on our API, we probably don&#39;t want to have that enabled while we&#39;re developing locally. So we can check the <code>NODE_ENV</code> to see what env we are in and conditionally track based on the environment.\n<br>\nThis is very powerful! However, having a bunch of the same conditionals sprinkled across our app can make it tough when we need to make changes. That&#39;s why we&#39;re going to centralized all the dynamic values of our app that depend on the current env. This way, we only have to change one file to completely change how our app works.</p>\n","slug":"env-and-stage","title":"Env and Stage","section":"Global Config","icon":"globe-africa","filePath":"/home/runner/work/API-design-v4/API-design-v4/lessons/10-global-config/A-env-and-stage.md","nextSlug":"/API-design-v4/lessons/global-config/configs","prevSlug":"/API-design-v4/lessons/error-handlers/custom-handler"}},"__N_SSG":true}